### Agenda - Select Data from DataFrame 

* what is columns and index in DataFrame
* How to select single columns and multiple columns 
* How to select data with loc  and iloc

In [17]:
import pandas as pd

In [18]:
student_marks={'Alex':[20,40,4,5],
               'Denis':[3,4,6,7],
               'Charls':[9,2,9,1],
                'Lewis':[10,3,81,4],
               'Leung':[90,1,5,3]}

In [19]:
df= pd.DataFrame(student_marks)

In [20]:
df

   Alex  Denis  Charls  Lewis  Leung
0    20      3       9     10     90
1    40      4       2      3      1
2     4      6       9     81      5
3     5      7       1      4      3

### Index

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

### list columns names

In [22]:
df.columns

Index(['Alex', 'Denis', 'Charls', 'Lewis', 'Leung'], dtype='object')

### Select single columns  and mupltiple columns

In [25]:
df[["Alex","Denis"]]

   Alex  Denis
0    20      3
1    40      4
2     4      6
3     5      7

### iloc function

In [27]:
df

   Alex  Denis  Charls  Lewis  Leung
0    20      3       9     10     90
1    40      4       2      3      1
2     4      6       9     81      5
3     5      7       1      4      3

In [26]:
df.iloc[0,1]

3

###  loc function

In [29]:
df.loc[0,"Alex"]

20

In [31]:
df.index=list('abcd')

In [32]:
df

   Alex  Denis  Charls  Lewis  Leung
a    20      3       9     10     90
b    40      4       2      3      1
c     4      6       9     81      5
d     5      7       1      4      3

In [34]:
df.loc["a","Alex"]

20

In [35]:
df.iloc[0,1]

3

In [36]:
df.iloc[0:1,0:2]

   Alex  Denis
a    20      3